#define _CRT_SECURE_NO_WARNINGS 1
//int 4byte - 32bit
//char 1byte- 8bit

//int main()
//{
//	char a = 5;
//	//00000000000000000000000000000101
//	//00000101    a
//	char b = 126;
//	//00000000000000000000000001111110
//	//01111110    b
//
//	char c = a + b;
//	//00000000000000000000000000000101    a运算时整形提升
//	//00000000000000000000000001111110    b运算时整形提升
//	//00000000000000000000000010000011    a+b
//	//10000011    c
//	//11111111111111111111111110000011 - 补码
//	//11111111111111111111111110000010
//	//10000000000000000000000001111101   -125
//	//
//	printf("%d\n", c);//-125
//
//	return 0;
//}
//
//int main()
//{
//	char a = 0xb6;
//	short b = 0xb600;
//	int c = 0xb6000000;
//
//	if (a == 0xb6)
//		printf("a");
//
//	if (b == 0xb600)
//		printf("b");
//
//	if (c == 0xb6000000)
//		printf("c");
//
//	return 0;
//}
/*实例1中的a, b要进行整形提升, 但是c不需要整形提升
a, b整形提升之后, 变成了负数, 
所以表达式 a == 0xb6, b == 0xb600 的结果是假, 但是c不发生整形提升, 则表
达式 c == 0xb6000000 的结果是真.
所程序输出的结果是: c
*/
//int main()
//{
//	char c = 1;
//	printf("%u\n", sizeof(c));//1
//	printf("%u\n", sizeof(+c));//4
//	printf("%u\n", sizeof(-c));//4
///*
// c只要参与表达式运算, 就会发生整形提升,
//表达式 + c, 就会发生提升, 所以 sizeof(+c) 是4个字节.
//表达式 - c 也会发生整形提升, 所以 sizeof(-c) 是4个字节,
//但是 sizeof(c), 就是1个字节.
//*/
//	return 0;
//}


	/*
 c只要参与表达式运算, 就会发生整形提升, 
表达式 + c, 就会发生提升, 所以 sizeof(+c) 是4个字节.
表达式 - c 也会发生整形提升, 所以 sizeof(-c) 是4个字节, 
但是 sizeof(c), 就是1个字节.
*/
//&& 左边为假，右边就不计算了
//|| 左边为真，右边就不计算了

#include <stdio.h>
int main()
{
	int i = 0, a = 0, b = 2, c = 3, d = 4;
	i = a++ || ++b || d++;//|| 左边为真，右边就不计算了

	printf("a = %d\nb = %d\nc = %d\nd = %d\n", a, b, c, d);
	return 0;
}
